%==========得到2ASK码元和基带信号=======================%
rs=1e3;%时间轴频率步进
fc=1e2;%载波频率100HZ
tzd=1e2;%1个码元用100个点模拟
t=0:1/rs:(tzd-1/rs);
for snrb=0:1:10 %不同信噪比
    ratio=0;%初始误码数设为0，累计十次得到总误码数
    for k=1:10 %十次循环产生10000码元
n=1e3;%一次产生码元数
g=randint(1,n);%产生1000个码元
tz=g(ceil(10*t+(1/rs))).*cos(2*pi*fc*t);%得到调制信号tz，100个点表示1个码元
%============信号通过噪声信道============================% 
signal=awgn(tz,snrb);%信号通过白噪声信道
%=================解调过程================================%
Fs=1e3;%采样频率 
[b,a]=butter(2,[80,120]*2/Fs);%设计巴特沃斯带通滤波器，2阶，系数为a,b
sg1=filter(b,a,signal);%信号通过该BPF
sg2=2*sg1.*cos(2*pi*fc*t);%信号通过相乘器
Fs=1e3;%采样频率 
[b,a]=butter(2,10*2/Fs)%设计巴特沃斯低通滤波器   
sg3=filter(b,a,sg2);%信号通过该LPF
%=================判决过程================================%
b=0.4;%判决门限
LL=tzd/2;
for i=1:n
    if sg3((i-1)*tzd+LL)>b;%取sg2的中间的点作为判决点  
       sg4(i)=1;
   else 
       sg4(i)=0;
   end
end%得到判决后信号sg4
%=================相干解调计算误码率过程======================%
[numbers,pe] =symerr(g,sg4);%利用函数得到误码率和误码数
ratio=ratio+numbers;
end
r1=ratio/(n*10);%误码数除以总点数为误码率
pel(1,snrb+1)=r1;%11个信噪比对应的11个误码率存入数组pel
end
figure;%画图
x=0:1:10;
x1=10.^((x+7)./10);%分贝值转化为真值
y=0.5*(erfc(sqrt(x1/4)));%2ASK信号相干解调理论误码率计算
semilogy(x,pel,'-r',x,y,'-b');
legend('simulation','theoritical case');
xlabel('信噪比')
ylabel('误码率');grid on;
title('2ASK信号相干解调时信噪比与误码率的关系');